# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [53]:
import pandas as pd

# Read the CSV file into a DataFrame
file_path = "Pandas_Data_Practice/Data/Purchase_Data.csv"
df_data = pd.read_csv(file_path)

# Use the head() method to check the first few rows of the DataFrame
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [54]:
# View the data types of each column
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [55]:
# Slice the first two columns using .loc
result_1 = df_data.loc[:, ['invoice_number', 'invoice_time']]

# Display the result
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [56]:
# Slice the first two rows using .loc
result_2 = df_data.loc[:1]

# Display the result
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [57]:
# Slice the first four rows and the first five columns using .loc
result_3 = df_data.loc[:3, :'category_id']

# Display the result
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [58]:
# Slice specific rows and columns using .loc
result_4 = df_data.loc[[0, 4, 6], ['invoice_time', 'price']]

# Display the result
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [59]:
# Get the number of rows using the shape attribute
num_rows = df_data.shape[0]

# Display the number of rows without using print
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [60]:
# Get the number of rows using the shape attribute
num_rows = df_data.shape[0]

# Print out the last row of the DataFrame
df_data.iloc[num_rows - 1]

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [61]:
# Compute the average price charged
avg_price = df_data['price'].mean()

# Compute the maximum price charged
max_price = df_data['price'].max()

# Display the results
avg_price, max_price

(3.1920522110741363, 6.01)

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [62]:
# Compute the average price and average number of items purchased
avg_price, avg_num_items = df_data[['price', 'num_item']].mean()

# Display the results
avg_price, avg_num_items

(3.1920522110741363, 1.2983091787439613)

Create a column called "total", which is the product of the price and num_item columns.

In [63]:
# Create a new column called "total" as the product of "price" and "num_item" columns
df_data['total'] = df_data['price'] * df_data['num_item']

# Display the DataFrame to verify the new column
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [64]:
# Sort the DataFrame by the 'total' column in descending order
sorted_df = df_data.sort_values(by='total', ascending=False)

# Select the top three most expensive purchases
top_three_expensive = sorted_df.head(3)

# Compute the average price of the top three most expensive purchases
avg_price_top_three = top_three_expensive['price'].mean()

# Display the average price of the top three most expensive purchases
avg_price_top_three

2.0

How many different products are there?

In [65]:
# Count the number of unique products using the nunique() method
num_unique_products = df_data['product_id'].nunique()

# Display the number of different products
num_unique_products

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [66]:
# Use the describe() method to generate descriptive statistics
total_stats = df_data['total'].describe()

# Index the DataFrame to access the mean and median values
mean_total = total_stats['mean']
median_total = total_stats['50%']  # 50% corresponds to the median

# Compute the difference between the mean and median
difference = mean_total - median_total

# Display the difference
difference

0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [67]:
# Use the drop() method to delete the 'total' column
df_data.drop(columns='total', inplace=True)

# Display the DataFrame to verify the column deletion
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [1]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [72]:
# Convert the 'invoice_time' column to datetime with specified format
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'], format='%Y-%m-%d %H:%M:%S')

# Print out the new column types
df_data.dtypes

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
DOW                       object
Month                      int32
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [71]:
# Convert the 'invoice_time' column to datetime
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'], format='%Y-%m-%d %H:%M:%S')

# Create a new column "DOW" for Day of the Week
df_data['DOW'] = df_data['invoice_time'].dt.day_name()

# Create a new column "Month" for the month of the invoice
df_data['Month'] = df_data['invoice_time'].dt.month

# Print the head of the DataFrame to verify the changes
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,7
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,7
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,7

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [73]:
# Count the occurrences of each weekday in the 'DOW' column
weekday_counts = df_data['DOW'].value_counts()

# Get the number of purchases made on Wednesday
num_purchases_wed = weekday_counts['Wednesday']

# Display the number of purchases made on Wednesday
num_purchases_wed

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [74]:
import pandas as pd

# Read the Titanic dataset into a DataFrame
file_path = "Pandas_Data_Practice/Data/Titanic.csv"
df_titanic = pd.read_csv(file_path)

# Check the first few rows of the DataFrame
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [75]:
# Rename the columns "Name" to "Passenger_Name" and "Ticket" to "Ticket_Num"
df_titanic.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'}, inplace=True)

# Display the DataFrame to verify the column name changes
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [76]:
# Change the index of the DataFrame to the column 'PassengerId'
df_titanic.set_index('PassengerId', inplace=True)

# Display the DataFrame to verify the index change
df_titanic.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [77]:
# Select the name of passenger with PassengerID 896
passenger_896_name = df_titanic.loc[896, 'Passenger_Name']

# Display the name of passenger 896
passenger_896_name

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [78]:
# Reset the index of the DataFrame while keeping the 'PassengerID' column
df_titanic.reset_index(drop=False, inplace=True)

# Display the DataFrame to verify the index change
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [79]:
# Count the number of missing entries in the 'Age' column
missing_entries_age = df_titanic['Age'].isnull().sum()

# Display the number of missing entries in the 'Age' column
missing_entries_age

86

Compute the avg age of passengers ignoring the missing data.

In [80]:
# Compute the average age of passengers ignoring missing data
avg_age = df_titanic['Age'].mean(skipna=True)

# Display the average age of passengers
avg_age

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [81]:
# Compute the mean age
mean_age = df_titanic['Age'].mean()

# Replace missing values in the 'Age' column with the mean age
df_titanic['Age'].fillna(mean_age, inplace=True)

# Display the DataFrame to verify the changes
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [83]:
# Sort the DataFrame by the 'Age' column in descending order
df_sorted_age = df_titanic.sort_values(by='Age', ascending=False)

# Select the top 5 oldest passengers
top_5_oldest = df_sorted_age.head(5)

# Calculate the average age of the 5 oldest passengers
avg_age_top_5_oldest = top_5_oldest['Age'].mean()

# Display the average age of the 5 oldest passengers
avg_age_top_5_oldest

67.0